In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("data_cleaning_sample.csv")

In [3]:
df

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [4]:
df.sort_values("Age")

      Name   Age         City Gender              Email   Join Date
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [5]:
df.dropna()

    Name   Age         City Gender              Email   Join Date
0  Alice  25.0     New York      F  alice@example.com  01-05-2021
2    Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4  David  22.0       Mumbai      M  david@example.com  12-11-2019
6  Alice  25.0     New York      F  alice@example.com  01-05-2021
7  Alice  25.0     New York      F  alice@example.com  01-05-2021

In [6]:
df.dropna(subset=["Age"])

    Name   Age         City Gender              Email   Join Date
0  Alice  25.0     New York      F  alice@example.com  01-05-2021
2    Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4  David  22.0       Mumbai      M  david@example.com  12-11-2019
5    NaN  28.0        Delhi      F     eve@domain.com         NaN
6  Alice  25.0     New York      F  alice@example.com  01-05-2021
7  Alice  25.0     New York      F  alice@example.com  01-05-2021

In [8]:
df.sort_values("Age", ascending = False)

      Name   Age         City Gender              Email   Join Date
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [9]:
df2 = df.copy()

In [10]:
df2

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [12]:
df2 = df.sort_values(["Name" , "Age"]).copy()

In [13]:
df2

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN

In [23]:
df2.reset_index(drop = True, inplace = True)
##if we add inplace here then our data frame i.e df2 will be updated

In [24]:
df2

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1    Alice  25.0     New York      F  alice@example.com  01-05-2021
2    Alice  25.0     New York      F  alice@example.com  01-05-2021
3      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
5  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
6  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
7    David  22.0       Mumbai      M  david@example.com  12-11-2019
8      NaN  28.0        Delhi      F     eve@domain.com         NaN

In [25]:
df2

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1    Alice  25.0     New York      F  alice@example.com  01-05-2021
2    Alice  25.0     New York      F  alice@example.com  01-05-2021
3      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
5  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
6  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
7    David  22.0       Mumbai      M  david@example.com  12-11-2019
8      NaN  28.0        Delhi      F     eve@domain.com         NaN

In [28]:
df2["Rank"] = df2["Age"].rank(ascending = False,method = "dense")

In [29]:
df2

      Name   Age         City Gender              Email   Join Date  Rank
0    Alice  25.0     New York      F  alice@example.com  01-05-2021   3.0
1    Alice  25.0     New York      F  alice@example.com  01-05-2021   3.0
2    Alice  25.0     New York      F  alice@example.com  01-05-2021   3.0
3      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020   1.0
4  Charlie   NaN        Delhi      M    charlie@example  20-07-2021   NaN
5  Charlie   NaN        Delhi      M    charlie@example  20-07-2021   NaN
6  Charlie   NaN        Delhi      M    charlie@example  20-07-2021   NaN
7    David  22.0       Mumbai      M  david@example.com  12-11-2019   4.0
8      NaN  28.0        Delhi      F     eve@domain.com         NaN   2.0